---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetAllLoadedItemFiles
source: html/2bc97834-4739-5bb2-83d5-c3ae296250ad.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetAllLoadedItemFiles Method

Get list of all loaded fabrication item files.

## Syntax (C#)
```csharp
public IList<FabricationItemFile> GetAllLoadedItemFiles()
```

## Returns
Returns an array of the loaded fabrication item files.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The fabrication configuration is not set yet.